# -*- coding: utf-8 -*-
"""
Created on Sun Nov 17 04:47:34 2024

@author: dmhs0
"""

import time

# 評分量表======================================================================
is_golblin = [{"年收入低於100萬 - [3分]":["0", "3"], 
               "顏值自卑，抗拒上傳含臉照片 - [6分]":["0", "6"], 
               "身高低於172 - [3分]；[低於165 - 5分]":["0", "3", "5"], 
               "體脂>20% - [3分]":["0", "3"], 
               "幾乎沒朋友 - [6分]":["0", "6"],                
               "喜歡待在家(宅類興趣) - [4分]":["0", "4"], 
               "社恐(排斥與陌生人互動) - [4分]":["0", "4"],     
               "非自願單身>3年 - [6分]；[母單 - 8分]":["0", "6", "8"], 
               "以哥布林自居 - [1分]":["0", "1"],               
               "網路流量及回覆率低 - [3分]":["0", "3"],
               "毫無靈魂(覺得自己就這樣了) - [3分]":["0", "3"],  
               "無能(無專長、才華) - [3分]":["0", "3"], 
               "社交場合陪襯雜魚 - [3分]":["0", "3"],           
               "作答至今已破防 - [2分]":["0", "2"], 
               "帥 - [-10]分":["0", "-10"] }]

# 職業及裝備表==================================================================
occupation_and_equipment = [
    {"職業": "哥布林雜種", "裝備": "一般素T+小米手環9", "職業敘述": "不足已以哥布林自居，禁止冒充反抗軍身分，否則格殺勿論。"},  # 職業一 total_score < 18
    {"職業": "哥布林砲灰", "裝備": "發霉的褲襠破布+棍棒", "職業敘述": "初步兼具哥布林反抗軍特質，人生還有夢想，請加油"},  # 職業二 19 <= total_score < 22
    {"職業": "哥布林士兵", "裝備": "廉價布甲+生鏽的短劍", "職業敘述": "你已正式通過海選，恭喜加入冒險者反抗軍一員，期望你未來的發展"},  # 職業三 23 <= total_score < 30
    {"職業": "哥布林隊長", "裝備": "優質鎧甲+嫉妒長槍", "職業敘述": "偉大的哥布林神認可了你的能力，賦予你嫉妒長槍 (附魔:增強體味、增強頭髮油膩、增加鬍渣)，攻擊可穿透一般女性勇者香水防禦。\n特命你率領哥布林第一師團與勇者作戰，途中請注意女性冒險家、魅魔以及女性妖精"},  # 職業四 31 <= total_score < 38
    {"職業": "哥布林長老", "裝備": "妖精抗擊魔甲+油膩的雙手巨斧", "職業敘述": "你的力量來自於經驗與智慧，獲得傳說裝備: \n妖精抗擊魔甲 (附魔: 肥宅的絕對防禦，大幅提升汗臭味和油垢味，並降低暈船機率至1%)；\n油膩的雙手巨斧 (附魔: 油膩之觸，被你碰過的東西將被感染噁心氣息，使哥布林以外的女性感到噁心，於心中注入恐懼)。\n眾哥布林隊長: 你是我們的精神領袖，希望你能帶領我們走向勝利。"},  # 職業五 39 <= total_score < 46
    {"職業": "尤達大師", "裝備": "終極符文長袍+咒怨之匣", "職業敘述": "神選者，各方面噁宅能力已出神入化，開啟神話裝備:\n終極符文長袍 (附魔:仇恨酸霧，完美結合體味，對周圍10公尺內女性造成每秒3%最大忍耐度的真實傷害。忍耐度降至30%以下時，有15%機率觸發恐懼；降至10%以下時，觸發厭惡。 )\n咒怨之匣 (附魔: 低語者，受到你攻擊的女性被植入與朋友散播你噁心傳聞及謠言的暗示，使恐懼無限傳播)"},  # 職業六 47 <= total_score < 51
    {"職業": "傳說中的哥布林聖戰士", "裝備": "發黃的白內衣+拖鞋", "職業敘述": "幹嘛?你覺得你這職業聽起來很屌喔? 你沒救了你知道嗎? 建議砍掉重練比較快"}  # 職業七 total_score >= 51
]

# 職業檢測======================================================================
print('哥布林評分量表，滿18分你就是哥布林')
print('<滿分54分>\n18-22分 哥布林砲灰\n23-30分 哥布林士兵\n31-39分 哥布林隊長\n40-46分 哥布林長老\n47-52分 尤達大師\n53分以上 解鎖隱藏職業')
print('◆依照問題輸入分數，EX:年收入低於100萬 - (3分)，輸入 3 或 0 \n')

total_score = 0
chosen_handsome = False


thresholds = [18, 23, 31, 40, 47, 52] 

# 依次詢問問題並累加分數
for key, score in is_golblin[0].items():
    while True:
        value = input(f"{key}: ")
        if value not in score:
            print(f"連照著題目輸入數字都不會，連哥布林都不配")
        else:
            try:
                score_value = int(value)
                total_score += score_value
                if value == "-10":
                    chosen_handsome = True
                break
            except ValueError:
                print(f"算了，你當哥布林低能兒好了")

# 根據分數找對應職業
for i, threshold in enumerate(thresholds):
    if total_score < threshold:
        result = occupation_and_equipment[i]
        break
else:
    result = occupation_and_equipment[-1]  

# 結果顯示
print(f"\n{'='*40}\n哥布林指數: \n{total_score}分")
print(f"\n{'='*40}\n職業: \n{result['職業']}")
print(f"\n{'='*40}\n裝備: \n{result['裝備']}")
print(f"\n{'='*40}\n職業敘述: \n{result['職業敘述']}\n\n")

if chosen_handsome:
    print("<順帶一提，有人選擇了「帥」減了10分，臉皮也是厚>")

print("\n視窗將在 40 秒後自動關閉...")
time.sleep(40)